// 7. 10부제

/**
 * 자동차 10부제는 자동차 번호의 일의 자리 숫자와 날짜의 일의 자리 숫자가 일치하면 해당 자동차의 운행을 금 지하는 것이다.
 * 예를 들어, 자동차 번호의 일의 자리 숫자가 7이면 7일, 17일, 27일에 운행하 지 못한다.
 * 또한, 자동차 번호의 일의 자리 숫자가 0이면 10일, 20일, 30일에 운행하지 못한다.
 * 날짜의 일의 자리 숫자가 주어지고 7대의 자동차 번호의 끝 두 자리 수가 주어졌을 때 위반하는 자동차의 대수를 출력하는 프로그램을 작성하세요.
 * 입력 설명 : 첫 줄에는 날짜의 일의 자리 숫자가 주어지고 두 번째 줄에는 7대의 자동차 번호의 끝 두자리 숫자가 주어진다.
 * 출력 설명 : 주어진 날짜와 자동차의 일의 자리 숫자를 보고 10부제를 위반하는 차량의 대수를 출력합니다.
 * 입력 예제 : [3, [25, 23, 11, 47, 53, 17, 33]] >>> 3
 * 입력 예제2 : [0, [12, 20, 54, 30, 87, 91, 30]] >>> 3
 */

function solution(day, arr) {
    let numOfViolatedCars = 0

    for(let i = 0; i < arr.length; i++) {
        if(arr[i] % 10 === day) numOfViolatedCars++;
    }

    return numOfViolatedCars;
}

console.log(solution(3, [25, 23, 11, 47, 53, 17, 33])); // 3
console.log(solution(0, [12, 20, 54, 30, 87, 91, 30])); // 3

// 문제 풀이
function solution2(day, arr) {
    let answer = 0;
    
    for(let x of arr){
        if(x % 10 == day) answer++;
    }
    
    return answer;
}